# ThinHostFloorError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..ThinHostFloorError Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Rebar Cover Top and Bottom are too large for host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ThinHostFloorError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ThinHostFloorError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ThinHostFloorError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace